{"pageProps":{"note":{"id":"madilog","title":"Madilog","desc":"","updated":1741704456530,"created":1739782767097,"custom":{},"fname":"book-summaries.madilog","type":"note","vault":{"fsPath":"vault"},"contentHash":"12531994b7df22f018fc83499a2df6cb","links":[{"type":"wiki","from":{"fname":"book-summaries.madilog","id":"madilog","vaultName":"vault"},"value":"tags.TolakPPN12Persen","alias":"#TolakPPN12Persen","position":{"start":{"line":23,"column":395,"offset":2448},"end":{"line":23,"column":412,"offset":2465},"indent":[]},"xvault":false,"to":{"fname":"tags.TolakPPN12Persen"}}],"anchors":{"iklim":{"type":"header","text":"IKLIM","value":"iklim","line":21,"column":0,"depth":2},"peringatan":{"type":"header","text":"Peringatan","value":"peringatan","line":59,"column":0,"depth":2},"logika":{"type":"header","text":"Logika","value":"logika","line":75,"column":0,"depth":3},"dialektika--cara-berpikir-yang-melihat-perubahan":{"type":"header","text":"Dialektika : Cara Berpikir yang Melihat Perubahan","value":"dialektika--cara-berpikir-yang-melihat-perubahan","line":90,"column":0,"depth":3},"tiga-hukum-dialektika-kenapa-perubahan-terjadi":{"type":"header","text":"Tiga Hukum Dialektika: Kenapa Perubahan Terjadi?","value":"tiga-hukum-dialektika-kenapa-perubahan-terjadi","line":96,"column":0,"depth":4},"materialisme":{"type":"header","text":"Materialisme","value":"materialisme","line":123,"column":0,"depth":3},"melihat-ke-muka":{"type":"header","text":"Melihat ke Muka","value":"melihat-ke-muka","line":151,"column":0,"depth":2}},"children":[],"parent":"spfwom01chbihki1twghclf","data":{}},"body":"<h1 id=\"madilog\">Madilog<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#madilog\"></a></h1>\n<p>Madilog itu buku yang sering banget dibahas orang. Banyak yang bilang ini buku penting buat belajar berpikir kritis. Tapi jujur aja, gue berkali-kali coba baca, selalu mentok. Gaya bahasanya ribet, cara bertuturnya juga gak gampang dipahami. </p>\n<p>Sekarang, gara-gara tiba-tiba punya banyak waktu luang (thanks to layoff wkwkwk), gue akhirnya mutusin buat baca dan nyelesain buku ini. Tapi kenapa? Kenapa gue harus baca buku beginian di tahun 2025?</p>\n<p>Coba lo pikir, beberapa tahun terakhir, lo pasti liat:</p>\n<ul>\n<li>Pesulap Merah vs dukun, orang masih percaya hal mistis di era internet.</li>\n<li>Ferry Irwandi nantangin dukun, dan gak ada yang bisa nyatet dia wkwkwk.</li>\n<li>Orang gampang percaya hoax, gak kritis sama kebijakan pemerintah, dan gak paham gimana sistem ekonomi ngerugiin mereka sendiri.</li>\n<li>Banyak yang males mikir, asal ikut-ikutan, ujung-ujungnya rungkad: kejebak pinjol, judol, atau sekadar jadi korban clickbait.</li>\n</ul>\n<p>Buku ini ngajarin lo buat berpikir lebih tajam, lebih kritis, dan gak gampang ditipu—baik oleh dukun, pemerintah, maupun sistem yang ada. Gak cuma soal sejarah, tapi soal gimana cara kita mikir di zaman sekarang. Nah, ini catatan gue selama baca Madilog. Moga-moga lo bisa dapet sesuatu juga dari sini (kalo sempet mending baca sendiri aja wkwkwk). </p>\n<h2 id=\"iklim\">IKLIM<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#iklim\"></a></h2>\n<p>Saat membaca bagian <strong>IKLIM</strong>, gue merasa kondisi tahun 1942, ketika Tan Malaka menulis buku ini, tidak jauh berbeda dengan kondisi intelektual orang Indonesia saat ini.</p>\n<blockquote>\n<p><em>\"Saya pikir otak proletar mesin Indonesia tak bisa mencernakan paham yang berurat dan tumbuh pada masyarakat Indonesia dalam hal iklim, sejarah, keadaan jiwa dan idamannya.\"</em></p>\n</blockquote>\n<p>Gue merasa pada masa itu, kaum intelektual terlalu banyak mengadopsi teori Barat tanpa benar-benar memahami kondisi rakyatnya sendiri. Mereka belajar Marxisme, liberalisme, atau nasionalisme dari buku-buku Eropa, tapi belum tentu bisa mengaitkannya dengan realitas petani dan buruh Indonesia yang masih miskin, minim pendidikan, dan hidup di bawah sistem feodal. Saat itu, mereka memperjuangkan kemerdekaan dari Belanda dan Jepang.</p>\n<p>Hal yang sama terjadi sekarang. Pemerintah saat ini justru mencoba meniru sistem Nordic dengan menaikkan pajak tanpa terlebih dahulu mengadaptasi atau menyediakan fasilitas yang layak bagi rakyatnya. Ini terasa aneh sekali. Jadi, kebijakan ini gak lebih dari \"asal ikut-ikutan\" tanpa memikirkan kesejahteraan rakyatnya uangnya mau tapi kasih fasilitas ala kadarnya. Setelah marah dengan tagar <a href=\"https://x.com/search?q=%23TolakPPN12Persen&#x26;src=typed_query\">#TolakPPN12Persen</a> ramai diperbincangkan, barulah pemerintah membatalkan kebijakan tersebut.</p>\n<p>Di sub-bab <strong>Pendahuluan Perpustakaan</strong>, banyak hal menarik sekaligus mengejutkan. Bayangin lo baru umur 20-an, tapi udah dianggap sebagai \"musuh negara\" cuma gara-gara tulisan lo cuy. Tan Malaka diburu karena dia mengkritik kolonialisme dan ngajarin rakyat cara berpikir kritis. Belanda, Inggris, sampai Jepang nganggep dia ancaman karena pemikirannya bisa bikin rakyat sadar dan berontak. </p>\n<p>Kalau ini terjadi di zaman sekarang, mungkin dia bakal kena UU ITE atau dianggap \"radikal\" cuma karena ngajak orang buat mikir. Bedanya, di tahun 1940-an, yang ngejar dia bukan cuma polisi, tapi juga agen intelijen dari berbagai negara. Gue tuh pas baca sempet gak percaya, masa sih ada pemuda 20an tahun diburu gara-gara nulis, gue coba search ada dong yang bahas wkwkwkwk.</p>\n<ul>\n<li><a href=\"https://world.time.com/2013/06/15/exiled-in-hong-kong-famous-company-for-edward-snowden/slide/tan-malaka/\">Tan Malaka di Time</a>  </li>\n<li><a href=\"https://www.cambridge.org/core/books/abs/ho-chi-minh-in-hong-kong/parallel-case-of-tan-malaka/33478E6EDE9DB65C89FD049EB18C235A\">Parallel Case of Tan Malaka - Cambridge</a>  </li>\n<li><a href=\"https://apjjf.org/2022/12/gunn\">Asia-Pacific Journal</a>  </li>\n</ul>\n<p>Sampai di titik ini, gue semakin kagum dengan cara pandang dan gaya hidupnya. Selain itu, ada beberapa paragraf menarik yang gue tangkap dari buku ini.</p>\n<blockquote>\n<p><em>\"Seorang pengarang atau ahli pidato, perlu akan catatan dari buku musuh, kawan ataupun guru.\"</em></p>\n</blockquote>\n<p>Gue nangkep maksud Tan Malaka di sini gini: kalau lo mau menang debat atau nyebarin ide, lo harus baca buku dari banyak perspektif. Banyak orang sekarang cuma baca informasi dari sisi yang mereka setujuin aja (filter bubble). Kalau lo liberal, lo cuma baca media pro-liberal. Kalau lo konservatif, lo cuma baca media pro-konservatif. Kalo lo suka mulyono lo akan baca berita pro mulyono, berita yang sebaliknya akan dikatain buzzer. Begutu juga dengan kubu anak abah dan politikus lainnya wkwkwkw</p>\n<p>Ini strategi yang cerdas sih. Tan Malaka ngajarin cara main yang beda. Dia bilang: \"Kalau lo mau menang debat atau bikin argumen kuat, lo harus paham cara pikir lawan juga.\"</p>\n<p>Di era sekarang? Lo jangan cuma baca media yang lo suka, coba juga liat sudut pandang lawan biar bisa nangkep di mana titik lemahnya argumen mereka.</p>\n<blockquote>\n<p><em>\"Selain dari pada buat dipakai sebagai barang bahan ini, buku-buku yang berarti tentulah besar faedahnya buat pengetahuan dalam arti umumnya.\"</em></p>\n</blockquote>\n<p>Yang gue tangkep dari kalimat ini, buku itu bukan cuma buat bahan debat, tapi juga buat memperluas wawasan secara umum. Pendidikan dan pemikiran kritis itu penting, bukan cuma buat revolusi atau perlawanan, tapi juga buat ngebangun masyarakat yang lebih baik.</p>\n<p>Ini juga masih relevan banget. Di era sekarang, orang lebih sering baca tweet pendek, nonton video TikTok 15 detik, atau percaya headline tanpa cek isi artikelnya. Masalahnya? Kalau lo cuma baca yang serba pendek dan gak dalem, lo gampang banget ketipu clickbait dan manipulasi informasi. Tan Malaka paham bahwa kalau lo mau punya pemikiran yang tajam, lo harus banyak baca dan bukan cuma baca yang pendek-pendek, tapi yang beneran ngasih lo konteks dan pemahaman mendalam.</p>\n<p>Mungkin itu aja yang bisa gue tulis di sub-bab ini. Sisanya, kayak cara dia belajar pakai teknik \"jembatan keledai\", udah banyak yang ngebahas sih, jadi gue skip aja.</p>\n<p>Oh iya, ada satu hal yang masih bikin gue penasaran—gimana caranya dia bisa nyampe Singapura tapi pakai paspor dari China? Wkwkwk.</p>\n<h2 id=\"peringatan\">Peringatan<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#peringatan\"></a></h2>\n<p>Gue lanjut ke bagian <strong>Pendahuluan - Peringatan</strong>. Dari yang gue tangkep, Tan Malaka mau ngejelasin kalau logika itu penting, tapi jangan sampai terlalu terpukau sampai lupa batasannya. Materialisme, dialektika, dan logika harus dipakai bareng-bareng buat memahami realitas. Gue salfok sama kalimat ini:</p>\n<blockquote>\n<p><em>\"Pemikir borjuis dan pemikir feodal bergantung pada dialektika mistika itu seperti seekor semut hanyut bergantung pada sepotong rumput yang diayun-ayunkan gelombang.\"</em></p>\n</blockquote>\n<p>Kalau dipikir-pikir, <em>pemikir borjuis dan feodal</em> ini masih eksis sampai sekarang. Gue sering lihat orang-orang yang pakai dialektika mistik buat kepentingan sendiri. Ada yang beneran gak paham realitas dan cuma ikut arus, tapi ada juga yang sebenernya ngerti. Mereka tahu cara ini works buat ngejaga kekuasaan dan ngambil lebih banyak, makanya mereka sengaja pakai trik ini buat nge-bego-begoin rakyat. Misalnya</p>\n<ul>\n<li>Politisi yang bilang \"kita harus bersabar, semua akan membaik dengan sendirinya,\" padahal sistemnya tetap korup dan gak ada yang diubah.</li>\n<li>Orang kaya yang nyuruh rakyat miskin bersyukur dan rajin ibadah biar rezeki lancar, tapi mereka sendiri hidup enak karena ngehisap tenaga buruh.</li>\n<li>Orang-orang yang percaya hidup harus \"nrimo\" dan gak boleh banyak tanya, padahal mereka sebenernya dimanfaatin sistem.</li>\n</ul>\n<p>Intinya? Dialektika mistika ini cara halus buat bikin orang tunduk, nerima keadaan, dan gak kritis sama realitas yang ada.</p>\n<p>Di sub-bab ini juga, gue mulai dikenalin sama istilah <em>Materialisme, Dialektika dan Logika (MADILOG)</em>. Gue coba memahami maksudnya biar bisa lebih gampang ngecerna isi buku ini. Intinya, <strong>MADILOG</strong> itu cara berpikir yang realistis, pragmatis, dan fleksibel. Kalau cuma pakai salah satu, belum tentu hasilnya tepat. Mungkin bakal lebih jelas kalau pakai contoh.  </p>\n<h3 id=\"logika\"><a href=\"https://id.wikipedia.org/wiki/Logika\"><strong>Logika</strong></a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#logika\"></a></h3>\n<p>Logika itu cara berpikir yang sistematis dan terstruktur. Kalau premisnya bener, maka kesimpulannya juga harus bener. Sederhananya, logika bikin kita bisa nyusun argumen yang masuk akal.  </p>\n<p>Misalnya:  </p>\n<ul>\n<li>Kalau hujan, jalanan jadi basah.  </li>\n<li>Sekarang hujan.  </li>\n<li>Berarti, jalanan pasti basah.  </li>\n</ul>\n<p>Kelihatannya simpel, kan? Tapi masalahnya, gak semua kenyataan bisa diteorikan sesederhana itu. Kalau cuma ngandelin logika doang tanpa lihat realitas, kita bisa aja kejebak di kesimpulan yang keliru.  </p>\n<p>Contohnya, <strong>\"Semua orang sukses karena kerja keras. Jadi kalau gue kerja keras, gue pasti sukses.\"</strong><br>\nKedengeran masuk akal, tapi kenyataannya gak sesederhana itu. Ada faktor lain yang ikut main—keberuntungan, networking, kesempatan, bahkan privilege. Jadi, logika itu penting, tapi kalau dipakai sendirian tanpa mempertimbangkan realitas, bisa-bisa kita percaya sesuatu yang kelihatannya bener, tapi sebenernya gak selalu sesuai sama dunia nyata.</p>\n<h3 id=\"dialektika--cara-berpikir-yang-melihat-perubahan\"><a href=\"https://id.wikipedia.org/wiki/Dialektik\">Dialektika</a> : Cara Berpikir yang Melihat Perubahan<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#dialektika--cara-berpikir-yang-melihat-perubahan\"></a></h3>\n<p>Gue mulai ngerti kalau <em>Dialektika</em> itu bukan sekadar konsep perubahan biasa, tapi cara berpikir yang ngejelasin kenapa perubahan itu terjadi. Segala sesuatu di dunia ini gak statis, semuanya berkembang dan berevolusi karena adanya kontradiksi di dalamnya. Lo gak bisa cuma nerima keadaan tanpa mempertanyakan <em>kenapa</em> sesuatu terjadi dan <em>gimana</em> prosesnya bisa berubah. Justru, dengan mempertanyakan dan melihat kontradiksi, kita bisa dapet pemahaman yang lebih dalam.  </p>\n<p><strong>Dialektika bukan sekadar perubahan yang terjadi begitu aja. Dialektika itu soal memahami KONTRADIKSI yang menyebabkan perubahan.</strong> Kalau lo cuma duduk diam dan berharap perubahan datang sendiri, itu bukan dialektika—itu <a href=\"https://id.wikipedia.org/wiki/Fatalisme\">fatalisme</a>! Sebaliknya, dialektika ngajarin kita buat ngelihat konflik dalam sistem yang ada dan nyari cara buat mendorong perubahan yang lebih baik. Biar lebih gampang, ada tiga hukum utama dialektika yang bisa bantu kita memahami kenapa dunia ini gak pernah benar-benar diam.</p>\n<h4 id=\"tiga-hukum-dialektika-kenapa-perubahan-terjadi\"><strong><a href=\"https://www.historicalmaterialism.org/a-review-of-friedrich-engels-and-the-dialectics-of-nature-by-kaan-kangal/#:~:text=&#x27;%20Engels%20listed%20three%20&#x27;laws%20of,168\">Tiga Hukum Dialektika</a>: Kenapa Perubahan Terjadi?</strong><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#tiga-hukum-dialektika-kenapa-perubahan-terjadi\"></a></h4>\n<ol>\n<li>\n<p><strong>Perubahan Kuantitatif jadi Kualitatif</strong><br>\nHal kecil yang terus bertambah bisa menyebabkan perubahan besar. Contoh: </p>\n<ul>\n<li>Sosial → Protes kecil di satu kota kalau terus meluas bisa berubah jadi revolusi. Contoh nyatanya <a href=\"https://en.wikipedia.org/wiki/Arab_Spring\">Arab Spring</a> atau <a href=\"https://id.wikipedia.org/wiki/Era_Reformasi\">demonstrasi reformasi 1998</a> di Indonesia.</li>\n<li>Sains → Air yang dipanaskan perlahan dari 25°C ke 99°C gak akan berubah bentuk. Tapi pas sampai 100°C? BOOM! Dia berubah jadi uap</li>\n</ul>\n</li>\n<li>\n<p><strong>Pertentangan dalam Segala Hal</strong><br>\nSegala sesuatu berkembang lewat konflik. Contoh: </p>\n<ul>\n<li>Ekonomi → Buruh vs kapitalis, kelas pekerja pengen upah tinggi, pemilik modal pengen biaya produksi rendah. Konflik ini yang bikin sistem ekonomi terus berkembang.</li>\n<li>Teknologi → Dulu, orang males pake smartphone karena layar sentuhnya jelek. Lalu muncul iPhone, touchscreen makin canggih, sekarang malah gak ada tombol sama sekali.</li>\n</ul>\n</li>\n<li>\n<p><strong>Negasi atas Negasi</strong><br>\nSistem lama digantikan oleh sistem baru, lalu berevolusi ke bentuk lain. Contoh: </p>\n<ul>\n<li>Ekonomi → Dulu manusia pake barter → uang logam → uang kertas → sekarang digital currency &#x26; crypto.</li>\n<li>Politik → Feodalisme runtuh, muncul monarki konstitusional → lalu berkembang jadi demokrasi modern.</li>\n<li>Teknologi → Dulu orang pakai Kaset (yang kalo mau rewind lo puter pake pulpen wkwkwk), terus pindah ke MP3, sekarang streaming langsung di Youtube Music atau Spotify.</li>\n<li>Transportasi → Dulu naik kuda, terus ada kereta uap, sekarang ada mobil listrik.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Dialektika bukan asal membantah tanpa dasar.</strong> Konsep ini ngelihat bahwa setiap ide berkembang lewat kontradiksi. Makanya, kalau kita mau benar-benar paham sesuatu, kita harus ngerti gimana pertentangan itu bekerja.  </p>\n<p><strong>Kalau lo ngerti dialektika, lo bakal sadar kalau perubahan itu bukan sekadar \"hukum alam\". Ada cara buat memahami dan bahkan mengarahkannya!</strong></p>\n<h3 id=\"materialisme\"><a href=\"https://id.wikipedia.org/wiki/Materialisme\"><strong>Materialisme</strong></a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#materialisme\"></a></h3>\n<p>Oke, sekarang gue coba untuk memahami materialisme, materialisme ini adalah cara berpikir yang fokus ke fakta dan realitas yang kongkrit. Segala sesuatu yang ada di muka bumi ini pasti punya penyebab materiil, gak ada tuh yang kebetulan dan ditentukan oleh takdir. Kalau ada kejadian atau fenomena tertentu, pasti ada faktor lain yang bisa dijelasin. Materialisme ngajarin kita buat liat bukti nyata dan pengalaman asli dalam memahami sesuatu. Misalnya:</p>\n<ul>\n<li>Orang miskin bukan karena \"sial\" atau \"karma,\" tapi karena faktor ekonomi, akses ke pendidikan, dan ketimpangan sosial.</li>\n<li>Teknologi bukan \"keajaiban,\" tapi hasil dari riset, investasi, dan pengembangan bertahun-tahun.</li>\n<li>Harga bahan pokok naik bukan karena \"kutukan,\" tapi karena rantai pasokan, inflasi, dan kebijakan ekonomi.</li>\n</ul>\n<p>Berangkat dari pengetahuan materialisme, lo udah bisa melihat realitas dan fakta. Tapi supaya lo bisa menganalisis sesuatu secara lebih mendalam, kita perlu menggabungkan materialisme dengan logika dan dialektika. Lo pake logika materialisme kalau lo mau memahami sesuatu yang sifatnya tetap dan konkret, misalnya:</p>\n<p>Logika Materialisme → Dipakai buat memahami sesuatu yang tetap dan konkret. Contoh:</p>\n<ul>\n<li>Gimana cara kerja mesin?</li>\n<li>Kenapa algoritma Youtube bisa ngarahin kita ke video tertentu?</li>\n<li>Kenapa harga barang bisa naik dan turun?</li>\n</ul>\n<p>Tapi kalau lo mau memahami sesuatu yang terus berubah dan berkembang, Misalnya:</p>\n<ul>\n<li>Kenapa politik selalu berubah?</li>\n<li>Kenapa sistem ekonomi berkembang dari feodalisme ke kapitalisme?</li>\n<li>Kenapa budaya atau tren sosial terus bergeser?</li>\n</ul>\n<p>Lo mesti mempertanyakan dan melihat sesuatu sebagai proses yang terus berubah. Ini yang disebut dialektika materialisme—cara memahami perubahan dengan melihat kontradiksi yang ada di dalamnya.</p>\n<p>Kalau lo cuma pake logika materialisme doang, lo bakal ngerti realitas, tapi gak paham perubahan. Kalau lo cuma pake dialektika materialisme doang, lo bakal ngerti perubahan, tapi bisa kehilangan pijakan fakta konkret. Kalau lo gabungin semuanya, lo bakal bisa mikir secara sistematis, berbasis fakta, dan paham bagaimana perubahan terjadi.</p>\n<p>Materialisme ngajarin kita buat melihat dunia berdasarkan fakta konkret, bukan mistik atau mitos. Logika materialisme bikin kita bisa memahami realitas yang ada, tapi kalau kita mau ngerti kenapa sesuatu berubah, kita butuh dialektika materialisme. Dengan gabungan ketiganya, kita bisa punya cara berpikir yang lebih tajam dan gak gampang dimanipulasi.</p>\n<h2 id=\"melihat-ke-muka\">Melihat ke Muka<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#melihat-ke-muka\"></a></h2>\n<p>Oh ya, pas gue mulai masuk ke sub-bab terakhir dari pendahuluan, yaitu <strong>Melihat ke Muka</strong>. Ada satu kalimat yang menurut gue lucu:  </p>\n<blockquote>\n<p><em>\"Salah satu sifat rakyat Belanda yang terlihat pada saya adalah sifat demogogisch, ialah sifat berkilah, sifat suka mempertentangkan perkara kecil-kecil dengan melupakan pokok yang besar.\"</em>  </p>\n</blockquote>\n<p>Kenapa ini lucu? Wkwkwkwk. Soalnya kalau kita lihat zaman sekarang, terus liat keributan di <strong>X.com</strong>, kayaknya apa aja bisa jadi bahan ribut. Hal-hal sepele dibesar-besarkan, sedangkan masalah yang lebih penting malah kelewat.  </p>\n<p>Jadi gue kepikiran, ini sifat manusia pada umumnya? Atau jangan-jangan ini warisan dari Belanda yang <em>ditularkan</em> ke manusia Indonesia zaman sekarang? Wkwkwk.</p>\n<p>Thanks yak, udah kelar bab pendahuluan! Sisanya bakal gue lanjut di artikel selanjutnya biar gak kepanjangan.</p>","noteIndex":{"id":"oqxmejlafk9x8rj9t5hya5z","title":"Hello and Welcome! 👋","desc":"","updated":1742030256619,"created":1646842475821,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"f7db9d96297496e598d70248ef16b81f","links":[],"anchors":{"find-more":{"type":"header","text":"Find More","value":"find-more","line":20,"column":0,"depth":2}},"children":["spfwom01chbihki1twghclf","bsv930j2j6qlih60c7eu7wh","ohf85tu5nw2b8ewx6cetsmp","u3lhhpriar8wgcjw8svapha","tvdcga33h6hi7fxd9cwqd66","wvtpake5hh5uu6swigzu5dk"],"parent":null,"data":{},"body":"\nWelcome to the homepage! I use Dendron to store and organize notes, ideas, and experiments I’m working on. Here are the main sections you’ll find on this site:\n\n1. **Learning Notes** — Practical notes on programming, recent technologies, and productivity tips.\n2. **Personal Projects** — Summaries of projects, experiments, and outcomes I’m working on or have completed.\n3. **Writings & Opinions** — Casual articles and reflections about technology, daily life, and other interesting topics.\n\nI’m constantly experimenting and learning. I hope the content here helps you as a reference, a starting point for discussion, or just light reading.\n\n> Why Dendron?\n>\nDendron helps keep notes organized. Its \"seed\" and \"vault\" concepts make it easy to structure content and find what you need.\n\n## Find More\n\nIf you want to learn more or connect, check these links:\n\n- [Homepage (Dendron)](https://zeihanaulia.github.io/sotoy/)\n- [My GitHub](https://github.com/zeihanaulia)\n- [My Twitter / X](https://x.com/zeihanaulia)\n\nThanks for stopping by. If you have feedback or want to chat, feel free to reach out.\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"dendronVersion":"0.83.0","vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"seeds":{"dendron.templates":{}},"enableFullHierarchyNoteTitle":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":true,"siteRootDir":"docs","seo":{"title":"Sotoy","description":"Personal knowledge space about anything I learn. Notes, knowledge, and ideas from me.","author":"Zeihan Aulia","twitter":"zeihanaulia","image":{"url":"https://pbs.twimg.com/profile_images/502375255256485888/1UYtt7PT_400x400.jpeg","alt":"Software Engineer, "}},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/sotoy","siteUrl":"https://zeihanaulia.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault-private","vault","dendron.templates"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}